In [155]:
import pandas as pd
import numpy as np
def spayedDogs():
    df = pd.read_csv('YourFileName.txt', sep='\t') # read the file
    df = df[['breed','spayed_or_neutered']] # considering the appropriate column name only
    #converting Yes/No into 1 and 0
    df['spayed_or_neutered'] = np.where(df['spayed_or_neutered']=='Yes' ,1,0) 
    # Apply groupby on 'breed' column to get breed and respective mean.
    # Here spayed_or_neutered values are 1 or 0 ,hence,its mean will act as a percentage
    # if we multiply it with 100
    df = df.groupby(['breed']).mean()
    df.reset_index(inplace=True) 
    df['spayed_or_neutered'] = df['spayed_or_neutered']*100
    # sorting to get top 10 breed with highest percentage
    df.sort_values(by=['spayed_or_neutered','breed'],ascending=False,inplace=True)
    # changing the sequence of column so as to print % and then breed
    df = df[['spayed_or_neutered','breed']] 
    print(df.head(10).to_string(index=False,header=False))
spayedDogs()

 100.000000              Russian Wolfhound
 100.000000                Belgian Griffon
 100.000000              Australian Kelpie
  97.080292                      Greyhound
  94.805195                Tibetan Terrier
  94.299287     German Shepherd Crossbreed
  93.750000                         Briard
  93.526921  Labrador Retriever Crossbreed
  93.333333      Coonhound, Treeing Walker
  92.857143                    Schipperkee

In [146]:
df =pd.read_csv('dogs_of_NYC.txt', sep='\t')

In [147]:
df = df[['breed','spayed_or_neutered']]

In [115]:
df['spayed_or_neutered'] = np.where(df['spayed_or_neutered']=='Yes' ,1,0)

In [116]:
df

                   breed  spayed_or_neutered
0           Afghan Hound                   1
1           Afghan Hound                   1
2           Afghan Hound                   1
3           Afghan Hound                   1
4           Afghan Hound                   1
...                  ...                 ...
81537  Yorkshire Terrier                   0
81538  Yorkshire Terrier                   0
81539  Yorkshire Terrier                   0
81540  Yorkshire Terrier                   0
81541  Yorkshire Terrier                   0

[81542 rows x 2 columns]

In [117]:
t = df.groupby(['breed']).mean()

In [118]:
t.reset_index(inplace=True)

In [119]:
t['spayed_or_neutered'] = t['spayed_or_neutered']*100

In [120]:
t.head()

                                  breed  spayed_or_neutered
0                          Afghan Hound           80.000000
1                                 Akita           67.200000
2                      Akita Crossbreed           78.378378
3                   American Eskimo dog           80.930233
4  American Pit Bull Mix / Pit Bull Mix           72.979493

In [123]:
t.sort_values(by=['spayed_or_neutered','breed'],ascending=False,inplace=True)

In [124]:
t.head(10)

                             breed  spayed_or_neutered
110              Russian Wolfhound          100.000000
16                 Belgian Griffon          100.000000
8                Australian Kelpie          100.000000
66                       Greyhound           97.080292
128                Tibetan Terrier           94.805195
60      German Shepherd Crossbreed           94.299287
27                          Briard           93.750000
79   Labrador Retriever Crossbreed           93.526921
48       Coonhound, Treeing Walker           93.333333
114                    Schipperkee           92.857143

In [103]:
t[t['dog_name'] =='Buddy']

     dog_name  spayed_or_neutered
1721    Buddy            0.814691

In [51]:
df[df['dog_name'] == 'Buddy']

      dog_name spayed_or_neutered
0        Buddy                Yes
84       Buddy                 No
156      Buddy                Yes
170      Buddy                 No
341      Buddy                Yes
...        ...                ...
80472    Buddy                Yes
80794    Buddy                Yes
80795    Buddy                Yes
81373    Buddy                 No
81438    Buddy                 No

[599 rows x 2 columns]

In [40]:
df['dog_name'].unique().shape

(13803,)

In [46]:
df.columns

Index(['dog_name', 'gender', 'breed', 'birth', 'dominant_color',
       'secondary_color', 'third_color', 'spayed_or_neutered',
       'guard_or_trained', 'borough', 'zip_code'],
      dtype='object')

In [36]:
df[df['dog_name']=='Buddy']

,dog_name,gender,breed,birth,dominant_color,secondary_color,third_color,spayed_or_neutered,guard_or_trained,borough,zip_code
0,Buddy,M,Afghan Hound,Jan-00,BRINDLE,BLACK,NaN,Yes,No,Manhattan,10003
84,Buddy,M,Akita,6-Jan,BLACK,TAN,NaN,No,No,Bronx,10470
156,Buddy,M,Akita Crossbreed,4-Jan,BLACK,WHITE,NaN,Yes,No,Manhattan,10014
170,Buddy,M,Akita Crossbreed,10-Jun,BLACK,GRAY,BROWN,No,No,Brooklyn,11221
341,Buddy,M,American Eskimo dog,9-Mar,WHITE,NaN,NaN,Yes,No,Manhattan,10021
...,...,...,...,...,...,...,...,...,...,...,...
80472,Buddy,M,Yorkshire Terrier,10-May,BLACK,TAN,BROWN,Yes,No,Queens,11377
80794,Buddy,M,Yorkshire Terrier,11-Jan,BROWN,TAN,WHITE,Yes,No,Brooklyn,11216
80795,Buddy,M,Yorkshire Terrier,11-Jan,BROWN,GRAY,NaN,Yes,No,Staten Island,10304
81373,Buddy,M,Yorkshire Terrier,11-Nov,BLACK,TAN,NaN,No,No,Manhattan,10280
81438,Buddy,M,Yorkshire Terrier,11-Dec,BLACK,GOLD,NaN,No,No,Bronx,10466

In [35]:
df['dog_name'].values

array(['Buddy', 'Nicole', 'Abby', ..., 'Martini-Leonardo', 'Violet',
       'Pebbles'], dtype=object)

In [10]:
with open('dogs_of_NYC.txt', 'r') as file:
        em_data = file.readlines()

In [4]:
df =pd.DataFrame(columns=['dog_name','gender','breed','birth','dominant_color','secondary_color','third_color','spayed_or_neutered','guard_or_trained','borough','zip_code'])

In [11]:
d = em_data[1:]
d[0][:-1]

'Buddy\tM\tAfghan Hound\tJan-00\tBRINDLE\tBLACK\tn/a\tYes\tNo\tManhattan\t10003'

In [9]:
em_data = em_data[1:]
i=0
while i<len(em_data):
    t=em_data[i][:-1] # removing the \n ,i.e newline character
    t=t.split(',') # splitting a string into list
    df.loc[i] = t 
    i=i+1

ValueError: cannot set a row with mismatched columns

In [91]:
import pandas as pd

class Nation:

    def __init__(self):
        # read the file
        with open('UN.txt', 'r') as file:
            em_data = file.readlines() 
            
        # create a blank Dataframe
        df =pd.DataFrame(columns=['Name','Continent','Population','Land Area'])
        
        # Storing the values of text file into dataframe or Table like structure.
        i=0
        while i<len(em_data):
            t=em_data[i][:-1] # removing the \n ,i.e newline character
            t=t.split(',') # splitting a string into list
            df.loc[i] = t 
            i=i+1
        df = df.astype({'Population': 'float32'}) # By default datatype of Population is object,hence cast it to float
        df = df.astype({'Land Area':'float32'})  #  By default datatype of Land Area is object,hence cast it to float


    # calculate the population density
    def popDensity(self):
        df['PopDensity'] = df['Population']*1000000/df['Land Area']
    
    # print the top 5 country with highest population density.
    def denselyPopulated(self):
        self.popDensity()
        cntnt = input('Enter a Continent: ')
        t = list(df[df['Continent']==cntnt].sort_values('PopDensity',ascending=False).head(5)['Name'])
        print()
        if len(t)>0:
            for i in t:
                print(i)
        else:
            print('invalid input')

In [92]:
c = Nation() # creating object of a class

In [94]:
c.denselyPopulated() # call denselyPopulated to print top 5 densely populated country

Enter a Continent: Asia

Singapore
Bahrain
Maldives
Bangladesh
Lebanon

In [27]:
df.head()

          Name Continent Population Land Area
0  Afghanistan      Asia       31.8    251772
1      Albania    Europe        3.0     11100
2      Algeria    Africa       38.3    919595
3      Andorra    Europe       .085       181
4       Angola    Africa       19.1    481354

In [32]:
df = df.astype({'Population': 'float32'})
df = df.astype({'Land Area':'float32'})
df['PopDensity'] = df['Population']*1000000/df['Land Area']
list(df[df['Continent']=='South America'].sort_values('PopDensity',ascending=False).head(5)['Name'])

In [34]:
df = df.astype({'Land Area':'float32'})

In [35]:
df.dtypes

Name           object
Continent      object
Population    float32
Land Area     float32
dtype: object

In [36]:
df['PopDensity'] = df['Population']*1000000/df['Land Area']
list(df[df['Continent']=='South America'].sort_values('PopDensity',ascending=False).head(5)['Name'])

In [37]:
df.head()

          Name Continent  Population  Land Area  PopDensity
0  Afghanistan      Asia   31.799999   251772.0  126.304749
1      Albania    Europe    3.000000    11100.0  270.270270
2      Algeria    Africa   38.299999   919595.0   41.648768
3      Andorra    Europe    0.085000      181.0  469.613265
4       Angola    Africa   19.100000   481354.0   39.679738

In [57]:
list(df[df['Continent']=='South America'].sort_values('PopDensity',ascending=False).head(5)['Name'])

['Ecuador', 'Colombia', 'Venezuela', 'Brazil', 'Peru']

In [ ]:
sorted()